app/Controllers/Admin/DashboardController.php

    public function index()
    {
        $user = $this->currentUser();

        if ($user === null || ($user['role'] ?? '') !== 'admin') {
            return redirect()->to(base_url('login'))->with('error', 'Acces refuse.');
        }

        $congeModel = new CongeModel();
        $employeModel = new EmployeModel();

        // Absences du mois en cours
        $currentMonth = date('Y-m');
        $monthStart = $currentMonth . '-01';
        $monthEnd = date('Y-m-t'); // Dernier jour du mois

        $absencesThisMonth = $congeModel
            ->whereIn('statut', ['approuvee'])
            ->where('date_debut <=', $monthEnd)
            ->where('date_fin >=', $monthStart)
            ->select('conges.*, employes.nom, employes.prenom, types_conge.libelle')
            ->join('employes', 'employes.id = conges.employe_id')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->findAll();

        // === Graphique 1: Congés par mois ===
        $year = date('Y');
        $congesByMonth = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0];

        $allConges = $congeModel
            ->whereIn('statut', ['approuvee'])
            ->select('conges.*, DATE(date_debut) as start_date')
            ->findAll();
---
SELECT `conges`.*, `employes`.`nom`, `employes`.`prenom`, `types_conge`.`libelle`
FROM `conges`
JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `statut` IN ('approuvee')
AND `date_debut` <= '2026-05-31'
AND `date_fin` >= '2026-05-01'
SELECT `conges`.*, DATE(date_debut) as start_date
FROM `conges`
WHERE `statut` IN ('approuvee')

            'user' => $user,
            'stats' => [
                'employes' => $employeModel->countAllResults(),
                'pending' => $congeModel->where('statut', 'en_attente')->countAllResults(),
                'approved' => $congeModel->where('statut', 'approuvee')->countAllResults(),
                'refused' => $congeModel->whereIn('statut', ['refusee', 'annulee'])->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'en_attente'
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'approuvee'
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` IN ('refusee','annulee')