app/Controllers/Rh/DemandController.php

SELECT *
FROM `departements`
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'en_attente'
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'approuvee'
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'refusee'
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'annulee'
---
    public function index()
    {
        $user = $this->currentUser();

        if ($user === null || ($user['role'] ?? '') !== 'rh') {
            return redirect()->to(base_url('login'))->with('error', 'Accès refusé.');
        }

        $statut = $this->request->getGet('statut') ?? 'en_attente';
        $departementId = $this->request->getGet('departement_id');

        $departementId = $departementId !== '' && $departementId !== null ? (int) $departementId : null;

        $demandes = $departementId !== null
            ? $this->congeModel->byStatus($statut, $departementId)
            : $this->congeModel->byStatus($statut);

        $departements = $this->departementModel->findAll();

        $stats = [
            'en_attente' => $this->congeModel->where('statut', 'en_attente')->countAllResults(),
            'approuvee' => $this->congeModel->where('statut', 'approuvee')->countAllResults(),
            'refusee' => $this->congeModel->where('statut', 'refusee')->countAllResults(),
            'annulee' => $this->congeModel->where('statut', 'annulee')->countAllResults(),
        ];