app/Controllers/Rh/SoldeController.php

SELECT `soldes`.*, `employes`.`nom`, `employes`.`prenom`, `employes`.`departement_id`, `departements`.`nom` as `dept_libelle`, `types_conge`.`libelle` as `type_libelle`
FROM `soldes`
LEFT JOIN `employes` ON `employes`.`id` = `soldes`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
LEFT JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
WHERE `soldes`.`annee` = 2026
ORDER BY `employes`.`nom` ASC, `types_conge`.`libelle` ASC
SELECT *
FROM `departements`
---
    public function index()
    {
        $user = $this->currentUser();
        if ($user === null || ($user['role'] ?? '') !== 'rh') {
            return redirect()->to(base_url('login'))->with('error', 'Accès refusé.');
        }

        $departementId = $this->request->getGet('departement_id');
        $year          = (int) ($this->request->getGet('year') ?? date('Y'));
        $departementId = $departementId !== '' && $departementId !== null ? (int) $departementId : null;

        $query = $this->soldeModel
            ->select('soldes.*, employes.nom, employes.prenom, employes.departement_id, departements.nom as dept_libelle, types_conge.libelle as type_libelle')
            ->join('employes',     'employes.id = soldes.employe_id',              'left')
            ->join('departements', 'departements.id = employes.departement_id',    'left')
            ->join('types_conge',  'types_conge.id = soldes.type_conge_id',        'left')
            ->where('soldes.annee', $year);

        if ($departementId !== null) {
            $query->where('employes.departement_id', $departementId);
        }

        $soldes       = $query->orderBy('employes.nom', 'ASC')->orderBy('types_conge.libelle', 'ASC')->findAll();
        $departements = $this->departementModel->findAll();