app/Controllers/Employe/Auth.php

    public function attempt()
    {
        $response = redirect()->to(self::PATH_LOGIN);

        if ($this->request->is('post')) {
            $email = trim((string) $this->request->getPost('email'));
            $password = (string) $this->request->getPost('password');

            $user = $this->employeModel->where('email', $email)->first();
---
SELECT *
FROM `employes`
WHERE `email` = 'marie@techmada.mg'
 LIMIT 1