app/Controllers/Employe/Demandes.php

    public function create()
    {
        $user      = $this->currentUser();
        $employeId = $this->employeId();
        $year      = (int) date('Y');

        return view('employe/demandes/create', [
            'title'        => 'Nouvelle demande',
            'user'         => $user,
            'pendingCount' => $this->congeModel->countByStatus($employeId, 'en_attente'),
            'typesConge'   => $this->typeCongeModel->findAll(),
            'soldes'       => $this->soldeModel->forEmployeYear($employeId, $year),
            'year'         => $year,
        ]);
---
SELECT *
FROM `types_conge`

    public function store()
    {
        $response = redirect()->to(self::PATH_CREATE);

        if ($this->request->is('post')) {
            $rules = [
                'type_conge_id' => 'required|is_natural_no_zero',
                'date_debut'    => 'required|valid_date[Y-m-d]',
                'date_fin'      => 'required|valid_date[Y-m-d]',
                'motif'         => 'permit_empty|max_length[1000]',
            ];

            if (! $this->validate($rules)) {
                $response = redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
            } else {
                $payload = $this->buildDemandPayload();

                if ($payload['error'] !== null) {
                    $response = redirect()->back()->withInput()->with('errors', $payload['error']);
                } else {
                    $insertedId = $this->congeModel->insert($payload['data']);
---
INSERT INTO `conges` (`employe_id`, `type_conge_id`, `date_debut`, `date_fin`, `nb_jours`, `motif`, `statut`, `created_at`) VALUES (3, 2, '2026-06-04', '2026-06-05', 2, 'mariage', 'en_attente', '2026-05-20 08:29:30')

    private function hasDemandOverlap(int $employeId, string $dateDebut, string $dateFin): bool
    {
        return $this->congeModel->where('employe_id', $employeId)
            ->whereIn('statut', ['en_attente', 'approuvee'])
            ->groupStart()
                ->where('date_debut <=', $dateFin)
                ->where('date_fin >=', $dateDebut)
            ->groupEnd()
            ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `employe_id` = 24
AND `statut` IN ('en_attente','approuvee')
AND   (
`date_debut` <= '2026-05-14'
AND `date_fin` >= '2026-05-13'
 )