app/Controllers/Employe/Profil.php

SELECT *
FROM `employes`
WHERE `employes`.`id` = 3
---
    public function edit()
    {
        $employeId = (int) session()->get('employe_id');
        $employe = $this->employeModel->find($employeId);