app/Models/CongeModel.php

    public function forEmploye(int $employeId)
    {
        return $this->select('conges.*, types_conge.libelle as type_libelle, types_conge.deductible')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id', 'left')
            ->where('conges.employe_id', $employeId)
            ->orderBy('conges.created_at', 'DESC')
            ->orderBy('conges.id', 'DESC')
            ->findAll();
---
SELECT `conges`.*, `types_conge`.`libelle` as `type_libelle`, `types_conge`.`deductible`
FROM `conges`
LEFT JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`employe_id` = 3
ORDER BY `conges`.`created_at` DESC, `conges`.`id` DESC

    public function latestForEmploye(int $employeId, int $limit = 3)
    {
        return $this->select('conges.*, types_conge.libelle as type_libelle')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id', 'left')
            ->where('conges.employe_id', $employeId)
            ->orderBy('conges.created_at', 'DESC')
            ->orderBy('conges.id', 'DESC')
            ->findAll($limit);
---
SELECT `conges`.*, `types_conge`.`libelle` as `type_libelle`, `types_conge`.`deductible`
FROM `conges`
LEFT JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`employe_id` = 24
ORDER BY `conges`.`created_at` DESC, `conges`.`id` DESC

    public function countByStatus(int $employeId, string $status): int
    {
        return (int) $this->where('employe_id', $employeId)
            ->where('statut', $status)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `employe_id` = 3
AND `statut` = 'en_attente'

    public function allWithDetails(): array
    {
        return $this->select('conges.*, types_conge.libelle as type_libelle, employes.nom, employes.prenom, employes.departement_id, departements.nom as dept_libelle')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id', 'left')
            ->join('employes', 'employes.id = conges.employe_id', 'left')
            ->join('departements', 'departements.id = employes.departement_id', 'left')
            ->orderBy('conges.created_at', 'DESC')
            ->findAll();
---
SELECT `conges`.*, `types_conge`.`libelle` as `type_libelle`, `employes`.`nom`, `employes`.`prenom`, `employes`.`departement_id`, `departements`.`nom` as `dept_libelle`
FROM `conges`
LEFT JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
LEFT JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
ORDER BY `conges`.`created_at` DESC

    public function byStatus(string $status, ?int $departementId = null): array
    {
        $query = $this->select('conges.*, types_conge.libelle as type_libelle, employes.nom, employes.prenom, employes.departement_id, departements.nom as dept_libelle')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id', 'left')
            ->join('employes', 'employes.id = conges.employe_id', 'left')
            ->join('departements', 'departements.id = employes.departement_id', 'left')
            ->where('conges.statut', $status);

        if ($departementId !== null) {
            $query->where('employes.departement_id', $departementId);
        }

        return $query->orderBy('conges.created_at', 'DESC')->findAll();
---
SELECT `conges`.*, `types_conge`.`libelle` as `type_libelle`, `employes`.`nom`, `employes`.`prenom`, `employes`.`departement_id`, `departements`.`nom` as `dept_libelle`
FROM `conges`
LEFT JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
LEFT JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
WHERE `conges`.`statut` = 'en_attente'
ORDER BY `conges`.`created_at` DESC