app/Models/EmployeModel.php

    public function findByEmail(string $email): ?array
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `employes`
WHERE `email` = 'rh@techmada.mg'
 LIMIT 1