app/Models/SoldeModel.php

    public function forEmployeYear(int $employeId, int $year)
    {
        return $this->select('soldes.*, types_conge.libelle, types_conge.deductible')
            ->join('types_conge', 'types_conge.id = soldes.type_conge_id', 'left')
            ->where('soldes.employe_id', $employeId)
            ->where('soldes.annee', $year)
            ->orderBy('types_conge.libelle', 'ASC')
            ->findAll();
---
SELECT `soldes`.*, `types_conge`.`libelle`, `types_conge`.`deductible`
FROM `soldes`
LEFT JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
WHERE `soldes`.`employe_id` = 3
AND `soldes`.`annee` = 2026
ORDER BY `types_conge`.`libelle` ASC

    public function findForEmployeeTypeYear(int $employeId, int $typeCongeId, int $year)
    {
        return $this->where('employe_id', $employeId)
            ->where('type_conge_id', $typeCongeId)
            ->where('annee', $year)
            ->first();
---
SELECT *
FROM `soldes`
WHERE `employe_id` = 3
AND `type_conge_id` = 2
AND `annee` = 2026
 LIMIT 1